# IFCCategory Template Create Method

Source: https://www.revitapidocs.com/2026/ba0e5b7b-0cd9-5e96-3d67-65251bfa9071.htm

---

| IFCCategory Template Create Method |
| --- |

Create a IFC category mapping template with default values.
**Namespace:** Autodesk.Revit.DB
**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26\.0\.4\.0 (26\.0\.4\.0\) Syntax C\# VB C\+\+ F\#
```
public static IFCCategoryTemplate Create(
	Document document,
	string name
)
```

```
Public Shared Function Create (
	document As Document,
	name As String
) As IFCCategoryTemplate
```

```
public:
static IFCCategoryTemplate^ Create(
	Document^ document,
	String^ name
)
```

```
static member Create :
        document : Document *
        name : string -> IFCCategoryTemplate
```

#### Parameters

document Document
:   Document where created mapping template is saved.

name String
:   The name specified to this mapping template.

#### Return Value

IFCCategoryTemplate
The new mapping template instance. Exceptions

| Exception | Condition |
| --- | --- |
| ArgumentException | The name already exists. |
| ArgumentNullException | A non\-optional argument was null |

See Also

#### Reference

IFCCategoryTemplate Class Autodesk.Revit.DB Namespace